Функция РозничнаяЦена(АктуальнаяДата, ЭлементНоменклатуры) Экспорт
    
    Если ЭлементНоменклатуры = Неопределено Тогда
        Возврат 0;
    КонецЕсли;
    
    Попытка
        Отбор = Новый Структура("ТоварыИУслуги", ЭлементНоменклатуры);
        ЗначенияРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее(АктуальнаяДата, Отбор);
        
        Если ЗначенияРесурсов = Неопределено Тогда
            Возврат 0;
        КонецЕсли;
        
        Возврат ЗначенияРесурсов.Цена;
        
    Исключение
        // В случае ошибки возвращаем 0
        Возврат 0;
    КонецПопытки;
    
КонецФункции